// void main(){
//   if("Будильник зазвенел"){
//
//     do{
//       отключитьБудильник();
//     }while("Будильник не отключен");
//
//     do{
//       встатьСКровати();
//     }while("Не встал");
//     while("стою на ногах"){
//       учиться();
//       работать();
//       жить();
//     }
//
//     if("устал"){
//       выпитьПивка();
//       лечьСпать();
//   }else{
//       if('Сильно устал'){
//         лечьСпать();
//   }else{
//         полистатьЛентуВНедружественнойСоцсети();
//   }
//   }
//
//   }else{
//     спимДальше();
//   }
// }